bit-finance/Reports/бит_СтруктураВладения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>бит_СтруктураВладения</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаОтчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектИнвестирования</Name>
					<Type>
						<v8:Type>v8:ValueListType</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Акционер</Name>
					<Type>
						<v8:Type>v8:ValueListType</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

bit-finance/InformationRegisters/бит_СоставИнвесторов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бит_СоставИнвесторов</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДоляВладения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОбъектИнвестирования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Акционер</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_му_ВидыИнвесторов</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

bit-finance/Enums/бит_му_ВидыИнвесторов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_му_ВидыИнвесторов</Name>
			<Comment>(БИТ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеконтролирующиеАкционеры</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

bit-finance/Enums/бит_ЭлементыГрафическойСхемы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_ЭлементыГрафическойСхемы</Name>
			<Comment>(БИТ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Декорация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Линия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Старт</Name>
					<Comment>Старт</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Завершение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Условие</Name>
					<Comment>Условие</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Действие</Name>
					<Comment>Действие</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыборВарианта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Разделение</Name>
					<Comment>Разделение</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Слияние</Name>
					<Comment>Слияние</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обработка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВложенныйПроцесс</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

bit-finance/Catalogs/Контрагенты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Контрагенты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбособленноеПодразделение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЮридическоеФизическоеЛицо</Name>
					<Comment>Реквизит введен для совместимости с Библиотекой типов и не выводится в пользовательский интерфейс. Заполняется автоматически по данным реквизита ЮрФизЛицо.</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ЮридическоеФизическоеЛицо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтранаРегистрации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГоловнойКонтрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ИНН</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КПП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительнаяИнформация</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЮрФизЛицо</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЮрФизЛицо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НДСПоСтавкам4и2</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПоОКПО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегистрационныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НалоговыйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеМеждународное</Name>
					<Comment>Наименование в латинской транскрипции</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеВТранскрипции</Name>
					<Comment>Наименование в русской транскрипции</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>550</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДляСписка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДействуетС</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ИсторияКПП</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Период</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КПП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>9</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ИсторияНаименований</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Период</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СокращенноеНаименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

bit-finance/Reports/бит_СтруктураВладения/Forms/ФормаОтчета/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Отчет.ДатаОтчета                   = ТекущаяДатаСеанса();
	ПорогТочности                      = 2;
	ВыводитьНеконтролирующихАкционеров = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	НастроитьОтображениеРазделов();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДекорацияНастройкиНажатие(Элемент)
	
	СкрытьНастройки = НЕ СкрытьНастройки;
	НастроитьОтображениеРазделов();
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияГрафическаяСхемаНажатие(Элемент)
	
	СкрытьГрафическуюСхему = НЕ СкрытьГрафическуюСхему;
	Если СкрытьГрафическуюСхему Тогда
		ОтображатьТаблицуЗначений = Истина;
	КонецЕсли;
	НастроитьОтображениеРазделов();
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияТаблицаЗначенийНажатие(Элемент)
	
	ОтображатьТаблицуЗначений = НЕ ОтображатьТаблицуЗначений;
	Если НЕ ОтображатьТаблицуЗначений Тогда
		СкрытьГрафическуюСхему = Ложь;
	КонецЕсли;
	НастроитьОтображениеРазделов();
	
КонецПроцедуры

&НаКлиенте
Процедура ДолиУчастияПриИзменении(Элемент)
	
	БратьДанныеИзКэша = Истина;
	СформироватьОтчет(БратьДанныеИзКэша);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектИнвестированияОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
	
	Если ВыбранноеЗначение = Тип("СписокЗначений") Тогда
		НастроитьОтборСписком(Элемент, СтандартнаяОбработка);
	Иначе
		НастройкаПодсказкиОбъектаИнвестирования();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектИнвестированияНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	ОбъектИнвестирования = Отчет.ОбъектИнвестирования;
	Если ТипЗнч(ОбъектИнвестирования) = Тип("СписокЗначений") Тогда
		НастроитьОтборСписком(Элемент, СтандартнаяОбработка);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектИнвестированияПриИзменении(Элемент)
	
	НастройкаПодсказкиОбъектаИнвестирования();
	
КонецПроцедуры

&НаКлиенте
Процедура АкционерПриИзменении(Элемент)
	
	НастройкаПодсказкиАкционера();
	
КонецПроцедуры

&НаКлиенте
Процедура АкционерНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	Акционер = Отчет.Акционер;
	Если ТипЗнч(Акционер) = Тип("СписокЗначений") Тогда
		НастроитьОтборСписком(Элемент, СтандартнаяОбработка);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура АкционерОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
	
	Если ВыбранноеЗначение = Тип("СписокЗначений") Тогда
		НастроитьОтборСписком(Элемент, СтандартнаяОбработка);
	Иначе
		НастройкаПодсказкиАкционера();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыГрафическаяСхема

&НаКлиенте
Процедура ГрафическаяСхемаВыбор(Элемент)
	
	ТекущийЭлементСхемы = Элемент.ТекущийЭлемент;
	Если ТекущийЭлементСхемы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ТекущийЭлементСхемы) = Тип("ЭлементГрафическойСхемыДекорация") Тогда
		ДанныеЭлемента = ДанныеДекорацииСхемы(ТекущийЭлементСхемы);
		Если ЗначениеЗаполнено(ДанныеЭлемента) Тогда
			ПоказатьЗначение(, ДанныеЭлемента);
		КонецЕсли;
	ИначеЕсли ТипЗнч(ТекущийЭлементСхемы) = Тип("ЭлементГрафическойСхемыСоединительнаяЛиния") Тогда
		Акционер       = ДанныеДекорацииСхемы(ТекущийЭлементСхемы.НачалоЭлемент);
		ОбъектВладения = ДанныеДекорацииСхемы(ТекущийЭлементСхемы.КонецЭлемент);
		ОткрытьРасшифровкуВладения(Акционер, ОбъектВладения);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыДолиВладения

&НаКлиенте
Процедура ДолиВладенияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ДолиВладения.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПоказатьРасшифровкуРасчета(ТекущиеДанные);	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаСформироватьОтчет(Команда)
	
	СформироватьОтчет();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаДополнительныеНастройки(Команда)
	
	ДополнительныеНастройки = НЕ ДополнительныеНастройки;
	НастроитьОтображениеРазделов();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СформироватьОтчет(БратьДанныеИзКэша = Ложь)
	
	ГрафическаяСхема = Новый ГрафическаяСхема;
	ДанныеЭлементов.Очистить();
	ДолиВладения.Очистить();
	
	СоставИнвесторов = СоставИнвесторов(БратьДанныеИзКэша);
	ВизуализироватьСхему(СоставИнвесторов);
	ДолиВладения.Загрузить(СоставИнвесторов);
	
КонецПроцедуры

&НаСервере
Функция СоставИнвесторов(БратьДанныеИзКэша)
	
	Если БратьДанныеИзКэша
		И ЭтоАдресВременногоХранилища(КэшСоставИнвесторов) Тогда
		СоставИнвесторов = ПолучитьИзВременногоХранилища(КэшСоставИнвесторов);
	Иначе
		СоставИнвесторов = ВсеСоставыИнвесторовНаДату(Отчет.ДатаОтчета, ВыводитьНеконтролирующихАкционеров);
		ОтфильтроватьСоставИнвесторов(СоставИнвесторов);
		ДополнитьКосвенныеСвязиСоставаИнвесторов(СоставИнвесторов);
		ВычислитьЭффективныеДоли(СоставИнвесторов);
		КэшСоставИнвесторов = ПоместитьВоВременноеХранилище(СоставИнвесторов, УникальныйИдентификатор);
	КонецЕсли;
	
	Если ДолиУчастия = 0 Тогда
		ОтборПрямогоУчастия  = Новый Структура("ПрямоеВладение", Истина);
		СтрокиПрямогоУчастия = СоставИнвесторов.НайтиСтроки(ОтборПрямогоУчастия);
		СоставИнвесторов     = СоставИнвесторов.Скопировать(СтрокиПрямогоУчастия);
	КонецЕсли;
	
	Возврат СоставИнвесторов;
	
КонецФункции

&НаСервереБезКонтекста
Функция ВсеСоставыИнвесторовНаДату(ДатаОтчета, ВыводитьНеконтролирующихАкционеров)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СоставыИнвесторов.ОбъектИнвестирования КАК ОбъектИнвестирования,
	|	СоставыИнвесторов.Акционер КАК Акционер,
	|	СоставыИнвесторов.ДоляВладения КАК Доля,
	|	АВТОНОМЕРЗАПИСИ() КАК НомерЗаписи
	|ПОМЕСТИТЬ СоставыИнвесторов
	|ИЗ
	|	РегистрСведений.бит_СоставИнвесторов.СрезПоследних(&ДатаОтчета, ) КАК СоставыИнвесторов
	|ГДЕ
	|	СоставыИнвесторов.ОбъектИнвестирования <> СоставыИнвесторов.Акционер
	|	И (&ВыводитьНеконтролирующихАкционеров
	|			ИЛИ СоставыИнвесторов.Акционер <> ЗНАЧЕНИЕ(Перечисление.бит_му_ВидыИнвесторов.НеконтролирующиеАкционеры))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СоставыИнвесторов.ОбъектИнвестирования КАК ОбъектВладения,
	|	ПРЕДСТАВЛЕНИЕ(СоставыИнвесторов.ОбъектИнвестирования) КАК ОбъектВладенияСтрокой,
	|	ОрганизацииОбъектовВладения.СтранаРегистрации КАК СтранаРегистрацииОбъектаВладения,
	|	СоставыИнвесторов.Акционер КАК Акционер,
	|	ПРЕДСТАВЛЕНИЕ(СоставыИнвесторов.Акционер) КАК АкционерСтрокой,
	|	ЕСТЬNULL(ОрганизацииАкционеров.СтранаРегистрации, КонтрагентыАкционеров.СтранаРегистрации) КАК СтранаРегистрацииАкционера,
	|	СоставыИнвесторов.Доля КАК Доля,
	|	ИСТИНА КАК ПрямоеВладение,
	|	СоставыИнвесторов.НомерЗаписи КАК НомерЗаписи
	|ИЗ
	|	СоставыИнвесторов КАК СоставыИнвесторов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК ОрганизацииОбъектовВладения
	|		ПО СоставыИнвесторов.ОбъектИнвестирования = ОрганизацииОбъектовВладения.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК ОрганизацииАкционеров
	|		ПО СоставыИнвесторов.Акционер = ОрганизацииАкционеров.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК КонтрагентыАкционеров
	|		ПО СоставыИнвесторов.Акционер = КонтрагентыАкционеров.Ссылка";
	Запрос.УстановитьПараметр("ДатаОтчета",                         ДатаОтчета);
	Запрос.УстановитьПараметр("ВыводитьНеконтролирующихАкционеров", ВыводитьНеконтролирующихАкционеров);
	СоставИнвесторов = Запрос.Выполнить().Выгрузить();
	
	СоставИнвесторов.Индексы.Добавить("ОбъектВладения");
	СоставИнвесторов.Индексы.Добавить("Акционер");
	
	Возврат СоставИнвесторов; 
	
КонецФункции

&НаСервере
Процедура ОтфильтроватьСоставИнвесторов(СоставИнвесторов)
	
	Если ЗначениеЗаполнено(Отчет.ОбъектИнвестирования) Тогда
		НаложитьФильтрПоСвязи(СоставИнвесторов, "ОбъектВладения", Отчет.ОбъектИнвестирования);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Отчет.Акционер) Тогда
		НаложитьФильтрПоСвязи(СоставИнвесторов, "Акционер", Отчет.Акционер);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура НаложитьФильтрПоСвязи(СоставИнвесторов, ТипОтбора, ЗначениеФильтра)
	
	МенеджерФильтра   = Новый МенеджерВременныхТаблиц;
	СоздатьВременнуюТаблицуСостава(МенеджерФильтра, СоставИнвесторов);
	ВключенныеОбъекты = ОбъектыСвязанныеПоФильтру(МенеджерФильтра, ТипОтбора, ЗначениеФильтра);
	СоставИнвесторов  = СоставИнвесторовПоВключеннымОбъектам(МенеджерФильтра, ТипОтбора, ВключенныеОбъекты);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СоздатьВременнуюТаблицуСостава(МенеджерФильтра, СоставИнвесторов)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерФильтра;
	Запрос.Текст =
	"ВЫБРАТЬ * ПОМЕСТИТЬ СоставИнвесторов ИЗ &СоставИнвесторов КАК СоставИнвесторов";
	Запрос.УстановитьПараметр("СоставИнвесторов", СоставИнвесторов);
	Запрос.Выполнить();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ОбъектыСвязанныеПоФильтру(МенеджерФильтра, ТипОтбора, ЗначениеФильтра)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерФильтра;
	Запрос.Текст = ТекстЗапросаФильтраПоСвязи(ТипОтбора);
	
	Если ТипЗнч(ЗначениеФильтра) = Тип("СписокЗначений") Тогда
		ЗначениеОтбора = ЗначениеФильтра.ВыгрузитьЗначения();
	Иначе
		ЗначениеОтбора = Новый Массив;
		ЗначениеОтбора.Добавить(ЗначениеФильтра);
	КонецЕсли;
	
	Пока Истина Цикл
		Запрос.УстановитьПараметр("ЗначениеОтбора", ЗначениеОтбора);
		РезультатЗапроса = Запрос.Выполнить();
		Если РезультатЗапроса.Пустой() Тогда
			Прервать;
		КонецЕсли;
		СвязанныеПоля = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("СвязанноеПоле");
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ЗначениеОтбора, СвязанныеПоля);
	КонецЦикла;
	
	Возврат ЗначениеОтбора;
	
КонецФункции

&НаСервереБезКонтекста
Функция ТекстЗапросаФильтраПоСвязи(ТипОтбора)
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	&ВыборкаСвязанногоПоля КАК СвязанноеПоле
	|ИЗ
	|	СоставИнвесторов КАК СоставИнвесторов
	|ГДЕ
	|	&ОтборПоСвязи
	|	И &ОтборОтработанный";
	ПолеСвязи    = ?(ТипОтбора = "ОбъектВладения", "Акционер", "ОбъектВладения");
	
	ТекстЗамены  = СтрШаблон("СоставИнвесторов.%1", ПолеСвязи);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ВыборкаСвязанногоПоля", ТекстЗамены);
	
	ТекстЗамены  = СтрШаблон("СоставИнвесторов.%1 В (&ЗначениеОтбора)", ТипОтбора);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ОтборПоСвязи", ТекстЗамены);
	
	ТекстЗамены  = СтрШаблон("НЕ СоставИнвесторов.%1 В (&ЗначениеОтбора)", ПолеСвязи);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ОтборОтработанный", ТекстЗамены);
	
	Возврат ТекстЗапроса;
	
КонецФункции

&НаСервереБезКонтекста
Функция СоставИнвесторовПоВключеннымОбъектам(МенеджерФильтра, ТипОтбора, ВключенныеОбъекты)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерФильтра;
	ТекстЗапроса = "ВЫБРАТЬ * ИЗ СоставИнвесторов КАК СоставИнвесторов ГДЕ СоставИнвесторов.%1 В (&ВключенныеОбъекты)";
	ТекстЗапроса = СтрШаблон(ТекстЗапроса, ТипОтбора);
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("ВключенныеОбъекты", ВключенныеОбъекты);
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

&НаСервере
Процедура ДополнитьКосвенныеСвязиСоставаИнвесторов(СоставИнвесторов)
	
	КопияСоставаИнвесторов = СоставИнвесторов.Скопировать();
	Для каждого СтрокаСостава Из КопияСоставаИнвесторов Цикл
		ПараметрыАкционера = Новый Структура("Акционер, АкционерСтрокой, СтранаРегистрацииАкционера");
		ЗаполнитьЗначенияСвойств(ПараметрыАкционера, СтрокаСостава);
		ДополнитьКосвенныеСвязиАкционера(ПараметрыАкционера, СтрокаСостава.ОбъектВладения, СоставИнвесторов,
											КопияСоставаИнвесторов);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ДополнитьКосвенныеСвязиАкционера(ПараметрыАкционера, ОбъектВладения, СоставИнвесторов, КопияСоставаИнвесторов)
	
	Отбор = Новый Структура;
	Отбор.Вставить("Акционер", ОбъектВладения);
	ИсходящиеСвязи = КопияСоставаИнвесторов.НайтиСтроки(Отбор);
	Для каждого Владение Из ИсходящиеСвязи Цикл
		Отбор = Новый Структура;
		Отбор.Вставить("Акционер",       ПараметрыАкционера.Акционер);
		Отбор.Вставить("ОбъектВладения", Владение.ОбъектВладения);
		Если ПараметрыАкционера.Акционер = Владение.ОбъектВладения 
			ИЛИ СоставИнвесторов.НайтиСтроки(Отбор).Количество() > 0 Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяКосвеннаяСвязь = СоставИнвесторов.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяКосвеннаяСвязь, ПараметрыАкционера);
		ЗаполнитьЗначенияСвойств(НоваяКосвеннаяСвязь, Владение, "ОбъектВладения, ОбъектВладенияСтрокой, СтранаРегистрацииОбъектаВладения");
		НоваяКосвеннаяСвязь.Доля           = 0;
		НоваяКосвеннаяСвязь.ПрямоеВладение = Ложь;
		
		ДополнитьКосвенныеСвязиАкционера(ПараметрыАкционера, Владение.ОбъектВладения, СоставИнвесторов, КопияСоставаИнвесторов);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ВычислитьЭффективныеДоли(СоставИнвесторов)
	
	ОбщиеПараметрыРасчета = ОбщиеПараметрыРасчета();
	
	ТипЧисло  = Новый ОписаниеТипов("Число",
			   		Новый КвалификаторыЧисла(15, 2, ДопустимыйЗнак.Неотрицательный));
	ТипСтрока = Новый ОписаниеТипов("Строка", ,
					Новый КвалификаторыСтроки(0, ДопустимаяДлина.Переменная));
	СоставИнвесторов.Колонки.Добавить("ЭффективнаяДоля", ТипЧисло);
	СоставИнвесторов.Колонки.Добавить("РасшифровкаРасчета", ТипСтрока);
	
	ШаблонРасчета = "%1=%2%%" + Символы.ПС + Символы.ПС + "%3";
	
	Для каждого СтрокаИнвестирования Из СоставИнвесторов Цикл
		ПараметрыУравнения = НовыеПараметрыРасчетаДолей();
		ПараметрыУравнения.Акционер        = СтрокаИнвестирования.Акционер;
		ПараметрыУравнения.ОбъектВладения  = СтрокаИнвестирования.ОбъектВладения;
		ПараметрыУравнения.ЭффективнаяДоля = 0;
	
	    ПараметрыДействия = НовыеПараметрыРасчетаДолей();
		ЗаполнитьЗначенияСвойств(ПараметрыДействия, ПараметрыУравнения, "Акционер, ОбъектВладения");
		ПараметрыДействия.Последовательность   = СтрокаИнвестирования.ОбъектВладенияСтрокой;
		ПараметрыДействия.СфераОбъектаВладения = Истина;
		
		ДействияПороговыхИттераций = Новый Массив;
		РассчитатьЭффективнуюДолюПерекрестногоВладения(ПараметрыУравнения, ПараметрыДействия, СоставИнвесторов,
														ДействияПороговыхИттераций, ОбщиеПараметрыРасчета);
														
		Пока ДействияПороговыхИттераций.Количество() > 0 Цикл 
			ДействияПороговыхИттераций = РезультатОбработкиДействийПороговыхИттераций(ДействияПороговыхИттераций,
											ПараметрыУравнения, СоставИнвесторов, ОбщиеПараметрыРасчета);
		КонецЦикла;
		
		ДоляВПроцентах = ПараметрыУравнения.ЭффективнаяДоля * 100;
		СтрокаИнвестирования.ЭффективнаяДоля    = ДоляВПроцентах;
		СтрокаИнвестирования.РасшифровкаРасчета = СтрШаблон(ШаблонРасчета, ПараметрыУравнения.Расчет,
													Окр(ДоляВПроцентах, 3), ПараметрыУравнения.Последовательность);
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура РассчитатьЭффективнуюДолюПерекрестногоВладения(ПараметрыУравнения, ПараметрыДействия, СоставИнвесторов,
															ДействияПороговыхИттераций, ОбщиеПараметрыРасчета)
	
	Если ДостигнутПорогИттераций(ПараметрыДействия) Тогда
		ДействияПороговыхИттераций.Добавить(ПараметрыДействия);
		Возврат;
	КонецЕсли;
	
	Отбор          = Новый Структура("ОбъектВладения", ПараметрыДействия.ОбъектВладения);
	СтрокиОбъектов = СоставИнвесторов.НайтиСтроки(Отбор);
	Для каждого СтрокаОбъекта Из СтрокиОбъектов Цикл
		ДоляСтроки      = СтрокаОбъекта.Доля / 100;
		ЭффективнаяДоля = ПараметрыДействия.ЭффективнаяДоля * ДоляСтроки;
		Если ДостигнутПорогТочности(ЭффективнаяДоля, ОбщиеПараметрыРасчета) Тогда
			Прервать;
		КонецЕсли;
		
		СфераОбъектаВладения       = ПараметрыДействия.СфераОбъектаВладения;
		ПоследовательностьДействия = СтрШаблон("%1 -> %2", СтрокаОбъекта.АкционерСтрокой,
										ПараметрыДействия.Последовательность);
		РасчетДействия             = Строка(ДоляСтроки) +
										?(ПустаяСтрока(ПараметрыДействия.Расчет), "", "*" + ПараметрыДействия.Расчет);
										
		Если СтрокаОбъекта.Акционер = ПараметрыУравнения.Акционер И СфераОбъектаВладения Тогда
			СфераОбъектаВладения = Ложь;
			ДобавитьЭффективнуюДолюВладения(ПараметрыУравнения, ЭффективнаяДоля, ПоследовательностьДействия, РасчетДействия);
		КонецЕсли;
		
		Если ПараметрыУравнения.ЭффективнаяДоля > 1
			И НЕ ОбщиеПараметрыРасчета.ПолнаяЭффективнаяДоля Тогда
			// В соответствии с правилами расчета эффективная доля в итоге может превысить 100%.
			// Если расчеты не до полного значения, то дальнейшие вычисления не выполняются.
			ПараметрыУравнения.ЭффективнаяДоля = 1;
			Возврат;
		КонецЕсли;
		
		Если СтрокаОбъекта.Акционер = ПараметрыУравнения.ОбъектВладения Тогда
			СфераОбъектаВладения = Истина;
		КонецЕсли;
		
		ПараметрыНовогоДействия = НовыеПараметрыРасчетаДолей();
		ПараметрыНовогоДействия.ОбъектВладения       = СтрокаОбъекта.Акционер;
		ПараметрыНовогоДействия.ЭффективнаяДоля      = ЭффективнаяДоля;
		ПараметрыНовогоДействия.Последовательность   = ПоследовательностьДействия;
		ПараметрыНовогоДействия.СфераОбъектаВладения = СфераОбъектаВладения;
		ПараметрыНовогоДействия.Расчет               = РасчетДействия;
		ПараметрыНовогоДействия.Уровень              = ПараметрыДействия.Уровень + 1;
		РассчитатьЭффективнуюДолюПерекрестногоВладения(ПараметрыУравнения, ПараметрыНовогоДействия, СоставИнвесторов,
														ДействияПороговыхИттераций, ОбщиеПараметрыРасчета);
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ДобавитьЭффективнуюДолюВладения(ПараметрыУравнения, ЭффективнаяДоля, ПоследовательностьДействия, РасчетДействия)
	
	ПараметрыУравнения.ЭффективнаяДоля = ПараметрыУравнения.ЭффективнаяДоля + ЭффективнаяДоля;
	
	ДоляВПроцентах = Окр(ЭффективнаяДоля*100, 3);
	
	Если НЕ ПустаяСтрока(ПараметрыУравнения.Последовательность) Тогда
		ПараметрыУравнения.Последовательность = ПараметрыУравнения.Последовательность + Символы.ПС;
	КонецЕсли;
	ПараметрыУравнения.Последовательность = ПараметрыУравнения.Последовательность +
		СтрШаблон("• %1:• %2*100%%=%3%%", ПоследовательностьДействия, РасчетДействия, ДоляВПроцентах);

	Если НЕ ПустаяСтрока(ПараметрыУравнения.Расчет) Тогда
		ПараметрыУравнения.Расчет = ПараметрыУравнения.Расчет + "+";
	КонецЕсли;
	ПараметрыУравнения.Расчет = ПараметрыУравнения.Расчет + ДоляВПроцентах + "%";
	
КонецПроцедуры

&НаСервере
Функция ОбщиеПараметрыРасчета()
	
	ОбщиеПараметрыРасчета = Новый Структура;
	
	ЧислоЗнаков            = ПорогТочности + 2;
	ЗначениеПорогаТочности = (1 / Pow(10, ЧислоЗнаков));
	ОбщиеПараметрыРасчета.Вставить("ЗначениеПорогаТочности", ЗначениеПорогаТочности);
	ОбщиеПараметрыРасчета.Вставить("ПолнаяЭффективнаяДоля", ПолнаяЭффективнаяДоля);
	
	Возврат ОбщиеПараметрыРасчета; 
	
КонецФункции

&НаСервереБезКонтекста
Функция НовыеПараметрыРасчетаДолей()
	
	ПараметрыРасчета = Новый Структура;
	
	ПараметрыРасчета.Вставить("Акционер");
	ПараметрыРасчета.Вставить("ОбъектВладения");
	ПараметрыРасчета.Вставить("ЭффективнаяДоля",      1);
	ПараметрыРасчета.Вставить("Последовательность",   "");
	ПараметрыРасчета.Вставить("Расчет",               "");
	ПараметрыРасчета.Вставить("СфераОбъектаВладения", Ложь);
	ПараметрыРасчета.Вставить("Уровень",              0);
	
	Возврат ПараметрыРасчета;
	
КонецФункции

&НаСервереБезКонтекста
Функция ДостигнутПорогИттераций(ПараметрыДействия)
	
	ПорогИттераций = 250;
	Возврат ПараметрыДействия.Уровень > ПорогИттераций;
	
КонецФункции

&НаСервереБезКонтекста
Функция ДостигнутПорогТочности(Показатель, ОбщиеПараметрыРасчета)
	
	Возврат Показатель < ОбщиеПараметрыРасчета.ЗначениеПорогаТочности;
	
КонецФункции

&НаСервереБезКонтекста
Функция РезультатОбработкиДействийПороговыхИттераций(ДействияПороговыхИттераций, ПараметрыУравнения, СоставИнвесторов,
														ОбщиеПараметрыРасчета)
	
	НовыеДействияПороговыхИттераций = Новый Массив;
	Для каждого ПараметрыДействия Из ДействияПороговыхИттераций Цикл
		ПараметрыДействия.Уровень = 1;
		РассчитатьЭффективнуюДолюПерекрестногоВладения(ПараметрыУравнения, ПараметрыДействия, СоставИнвесторов,
															НовыеДействияПороговыхИттераций, ОбщиеПараметрыРасчета);
	КонецЦикла;
	Возврат НовыеДействияПороговыхИттераций;													
	
КонецФункции

&НаСервере
Процедура ВизуализироватьСхему(СоставИнвесторов)
	
	ТаблицаСвязей = бит_ГрафическиеСхемы.НоваяТаблицаСвязейЭлементовГрафическойСхемы();
	СхемаXDTO     = СериализаторXDTO.ЗаписатьXDTO(ГрафическаяСхема);
	
	ПараметрыСхемы = Новый Структура;
	ПараметрыСхемы.Вставить("ЭлементыПоИдентификаторам", Новый Соответствие);
	ПараметрыСхемы.Вставить("РазмещениеЭлементов",       Новый Соответствие);
	ПараметрыСхемы.Вставить("ПараметрыРазмещения",       ПараметрыРазмещенияЭлементовГрафическойСхемы());
	
	Счетчики = Новый Структура;
	Счетчики.Вставить("НомерСтроки",    1);
	Счетчики.Вставить("НомерКолонки",   1);
	Счетчики.Вставить("ИндексЭлемента", 1);
	
	ПараметрыЭлемента = Новый Структура;
	ПараметрыЭлемента.Вставить("КлючЭлемента",          Неопределено);
	ПараметрыЭлемента.Вставить("ПредставлениеЭлемента", "");
	ПараметрыЭлемента.Вставить("СтранаРегистрации",     Справочники.СтраныМира.ПустаяСсылка());
	ПараметрыЭлемента.Вставить("НомерСтроки",           1);
	ПараметрыЭлемента.Вставить("НомерКолонки",          1);
	
	НомерСвободнойКолонки = 1;
	
	Для каждого СтрокаИнвестора Из СоставИнвесторов Цикл
		ПараметрыЭлемента.НомерСтроки  = 1;
		ПараметрыЭлемента.НомерКолонки = НомерСвободнойКолонки;
		ПараметрыЭлемента.КлючЭлемента          = СтрокаИнвестора.ОбъектВладения;
		ПараметрыЭлемента.ПредставлениеЭлемента = СтрокаИнвестора.ОбъектВладенияСтрокой;
		ПараметрыЭлемента.СтранаРегистрации     = СтрокаИнвестора.СтранаРегистрацииОбъектаВладения;
		РазмещениеЭлемента    = РазместитьДекорациюСхемы(ПараметрыЭлемента, СхемаXDTO, ПараметрыСхемы, Счетчики);
		ЭлементОбъектВладения = РазмещениеЭлемента.Элемент;
		
		НовыйОбъектВладения = РазмещениеЭлемента.ЭтоНовый;
		Если НовыйОбъектВладения Тогда
			НомерСвободнойКолонки = НомерСвободнойКолонки + 1;
		Иначе
			ПараметрыЭлемента.НомерКолонки = РазмещениеЭлемента.НомерКолонки;
		КонецЕсли;
		
		ПараметрыЭлемента.НомерСтроки           = РазмещениеЭлемента.НомерСтроки + 1;
		ПараметрыЭлемента.КлючЭлемента          = СтрокаИнвестора.Акционер;
		ПараметрыЭлемента.ПредставлениеЭлемента = СтрокаИнвестора.АкционерСтрокой;
		ПараметрыЭлемента.СтранаРегистрации     = СтрокаИнвестора.СтранаРегистрацииАкционера;
		РазмещениеЭлемента = РазместитьДекорациюСхемы(ПараметрыЭлемента, СхемаXDTO, ПараметрыСхемы, Счетчики);
		ЭлементАкционер    = РазмещениеЭлемента.Элемент;
		
		ПредставлениеЛинии  = СтрШаблон("%1%%", ?(ДолиУчастия = 0, СтрокаИнвестора.Доля, СтрокаИнвестора.ЭффективнаяДоля));
		СоединительнаяЛиния = бит_ГрафическиеСхемы.НовыйЭлементСхемы(Перечисления.бит_ЭлементыГрафическойСхемы.Линия,
																	Счетчики.ИндексЭлемента, ПредставлениеЛинии);
		Если ЗначениеЗаполнено(СтрокаИнвестора.Доля) Тогда
			СоединительнаяЛиния.border = СериализаторXDTO.ЗаписатьXDTO(Новый Линия(ТипСоединительнойЛинии.Сплошная, 2));
		Иначе
			СоединительнаяЛиния.border = СериализаторXDTO.ЗаписатьXDTO(Новый Линия(ТипСоединительнойЛинии.Точечная, 2));
			СоединительнаяЛиния.endArrowStyle = СтильСтрелки.Незаполненная;
			СоединительнаяЛиния.lineColor     = ЦветаСтиля.бит_ЦветГиперссылки;
			СоединительнаяЛиния.textColor     = ЦветаСтиля.бит_ЦветГиперссылки;
		КонецЕсли;
		ПараметрыСхемы.ЭлементыПоИдентификаторам.Вставить(Счетчики.ИндексЭлемента, СоединительнаяЛиния);
		Счетчики.ИндексЭлемента = Счетчики.ИндексЭлемента + 1;
		СхемаXDTO.item.Добавить(СоединительнаяЛиния);
		бит_ГрафическиеСхемы.УстановитьПривязкуСоединительнойЛинии(СоединительнаяЛиния, ТаблицаСвязей,
																	ЭлементАкционер, ЭлементОбъектВладения);
	КонецЦикла;
	
	ПараметрыСхемы.ПараметрыРазмещения.МенятьГраниСоединенияЛиний = Ложь;
	бит_ГрафическиеСхемы.РазместитьЛинииСвязей(ТаблицаСвязей, ПараметрыСхемы.ЭлементыПоИдентификаторам,
												ПараметрыСхемы.ПараметрыРазмещения);
	ПараметрыСхемы.ПараметрыРазмещения.МенятьГраниСоединенияЛиний           = Истина;
	ПараметрыСхемы.ПараметрыРазмещения.ПроверятьПересечениеЛинийСЭлементами = Истина;
	ГрафическаяСхема = СериализаторXDTO.ПрочитатьXDTO(СхемаXDTO);
	бит_ГрафическиеСхемы.ОптимизироватьГрафическуюСхему(ГрафическаяСхема, ПараметрыСхемы.ПараметрыРазмещения);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПараметрыРазмещенияЭлементовГрафическойСхемы()
	
	ДлинаЯчейки         = 40;
	ПараметрыРазмещения = бит_ГрафическиеСхемы.НовыеПараметрыРазмещенияЭлементовСхемы(ДлинаЯчейки);
	ПараметрыРазмещения.ШиринаЭлемента = 160;
	ПараметрыРазмещения.ВысотаЭлемента = 80;
	ПараметрыРазмещения.ЛевоеПоле      = 60;
	Возврат ПараметрыРазмещения;
	
КонецФункции

&НаСервере
Функция РазместитьДекорациюСхемы(ПараметрыЭлемента, СхемаXDTO, ПараметрыСхемы, Счетчики)
	
	РазмещениеЭлемента = ПараметрыСхемы.РазмещениеЭлементов.Получить(ПараметрыЭлемента.КлючЭлемента);
	Если РазмещениеЭлемента <> Неопределено Тогда
		РазмещениеЭлемента.ЭтоНовый = Ложь;
		Возврат РазмещениеЭлемента;
	КонецЕсли;
	
	ЭлементДекорация  = бит_ГрафическиеСхемы.НовыйЭлементСхемы(Перечисления.бит_ЭлементыГрафическойСхемы.Декорация,
								Счетчики.ИндексЭлемента, ПараметрыЭлемента.ПредставлениеЭлемента);
	ПараметрыСхемы.ЭлементыПоИдентификаторам.Вставить(Счетчики.ИндексЭлемента, ЭлементДекорация);
	Счетчики.ИндексЭлемента = Счетчики.ИндексЭлемента + 1;
	ПрименитьОформлениеДекорацииБлока(ЭлементДекорация, ПараметрыЭлемента);
	ГраницыРазмещения = бит_ГрафическиеСхемы.ГраницыРазмещенияЭлементаСхемы(ПараметрыСхемы.ПараметрыРазмещения,
							ПараметрыЭлемента.НомерСтроки, ПараметрыЭлемента.НомерКолонки);
	бит_ГрафическиеСхемы.РазместитьЭлементНаСхеме(ЭлементДекорация, ГраницыРазмещения,
													ПараметрыСхемы.ПараметрыРазмещения);
	СхемаXDTO.item.Добавить(ЭлементДекорация);
	
	СохранитьДанныеЭлемента(ЭлементДекорация.itemCode, ПараметрыЭлемента.КлючЭлемента);
	
	РазмещениеЭлемента = Новый Структура;
	РазмещениеЭлемента.Вставить("Элемент",      ЭлементДекорация);
	РазмещениеЭлемента.Вставить("НомерСтроки",  ПараметрыЭлемента.НомерСтроки);
	РазмещениеЭлемента.Вставить("НомерКолонки", ПараметрыЭлемента.НомерКолонки);
	РазмещениеЭлемента.Вставить("ЭтоНовый",     Истина);
	ПараметрыСхемы.РазмещениеЭлементов.Вставить(ПараметрыЭлемента.КлючЭлемента, РазмещениеЭлемента);
	
	Возврат РазмещениеЭлемента;
	
КонецФункции

&НаСервереБезКонтекста
Процедура ПрименитьОформлениеДекорацииБлока(ЭлементДекорация, ПараметрыЭлемента)
	
	ЭлементДекорация.shape = ФигурыГрафическойСхемы.Блок;
	
	ПараметрыКартинки = ПараметрыКартинкиДекорации(ПараметрыЭлемента);
	Если ПараметрыКартинки <> Неопределено Тогда
		ЗаполнитьЗначенияСвойств(ЭлементДекорация, ПараметрыКартинки);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПараметрыКартинкиДекорации(ПараметрыЭлемента)
	
	ПараметрыКартинки = Новый Структура("picture, picturePlacement, pictureStyle");
	
	Картинка        = Неопределено;
	Пропорционально = Ложь;
	Объект          = ПараметрыЭлемента.КлючЭлемента;
	Если Объект = Перечисления.бит_му_ВидыИнвесторов.НеконтролирующиеАкционеры Тогда
		Картинка = БиблиотекаКартинок.бит_Акционеры;
	ИначеЕсли ТипЗнч(Объект) = Тип("СправочникСсылка.Организации") Тогда
		Если НЕ ЗначениеЗаполнено(ПараметрыЭлемента.СтранаРегистрации) Тогда
			Картинка = БиблиотекаКартинок.бит_Предприятие;
		ИначеЕсли ПараметрыЭлемента.СтранаРегистрации = Справочники.СтраныМира.Россия Тогда
			Картинка = БиблиотекаКартинок.бит_ЛокацияРФ;
		Иначе
			Картинка = БиблиотекаКартинок.бит_ЛокацияМир;
		КонецЕсли;
		Пропорционально = Истина;
	ИначеЕсли ТипЗнч(Объект) = Тип("СправочникСсылка.ФизическиеЛица")
		ИЛИ ТипЗнч(Объект) = Тип("СправочникСсылка.Контрагенты") Тогда
		Картинка = БиблиотекаКартинок.бит_Акционер;
	КонецЕсли;
	
	Если Картинка = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	РазмерКартинкиПропорционально = 2;
	
	ПараметрыКартинки.picture          = СериализаторXDTO.ЗаписатьXDTO(Картинка);
	ПараметрыКартинки.picturePlacement = ПоложениеКартинкиЭлементаГрафическойСхемы.Лево;
	ПараметрыКартинки.pictureStyle     = ?(Пропорционально, РазмерКартинкиПропорционально, 0);
	
	Возврат ПараметрыКартинки;
	
КонецФункции

&НаСервере
Процедура СохранитьДанныеЭлемента(ИмяЭлемента, СвязанныеДанные)
	
	Если ТипЗнч(СвязанныеДанные) <> Тип("СправочникСсылка.Организации")
		И ТипЗнч(СвязанныеДанные) <> Тип("СправочникСсылка.ФизическиеЛица")
		И ТипЗнч(СвязанныеДанные) <> Тип("СправочникСсылка.Контрагенты")Тогда
		Возврат;
	КонецЕсли;
	
	НоваяСтрокаДанных = ДанныеЭлементов.Добавить();
	НоваяСтрокаДанных.ИмяЭлемента     = ИмяЭлемента;
	НоваяСтрокаДанных.СвязанныеДанные = СвязанныеДанные;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьРасшифровкуРасчета(ПараметрыРасшифровки)
	
	РасшифровкаРасчета = ПараметрыРасшифровки.РасшифровкаРасчета;
	Если ПустаяСтрока(РасшифровкаРасчета) Тогда
		Возврат;
	КонецЕсли;
	
	Акционер       = ПараметрыРасшифровки.Акционер;
	ОбъектВладения = ПараметрыРасшифровки.ОбъектВладения;
	Уникальность   = УникальностьОкнаРасшифровки(Акционер, ОбъектВладения);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РасшифровкаРасчета", РасшифровкаРасчета);
	ПараметрыФормы.Вставить("Акционер",           ПараметрыРасшифровки.Акционер);
	ПараметрыФормы.Вставить("ОбъектВладения",     ПараметрыРасшифровки.ОбъектВладения);
	ПараметрыФормы.Вставить("ЗакрыватьПриЗакрытииВладельца", Истина);
	ОткрытьФорму("Отчет.бит_СтруктураВладения.Форма.РасшифровкаРасчета", ПараметрыФормы, ЭтотОбъект, Уникальность);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция УникальностьОкнаРасшифровки(Знач Акционер, Знач ОбъектВладения)
	
	Хеш = Новый ХешированиеДанных(ХешФункция.MD5);
	Хеш.Добавить(ИдентификаторОбъекта(Акционер));
	Хеш.Добавить(ИдентификаторОбъекта(ОбъектВладения));
	Возврат Хеш.ХешСумма;
	
КонецФункции

&НаСервереБезКонтекста
Функция ИдентификаторОбъекта(Объект)
	
	Если ТипЗнч(Объект) = Тип("ПеречислениеСсылка.бит_му_ВидыИнвесторов") Тогда
		Возврат Строка(Объект);
	КонецЕсли;
	
	Возврат Строка(Объект.UUID());
	
КонецФункции

&НаКлиенте
Функция ДанныеДекорацииСхемы(ЭлементДекорация)
	
	Отбор        = Новый Структура("ИмяЭлемента", ЭлементДекорация.Имя);
	СтрокиДанных = ДанныеЭлементов.НайтиСтроки(Отбор);
	Если СтрокиДанных.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат СтрокиДанных[0].СвязанныеДанные;
	
КонецФункции

&НаКлиенте
Процедура ОткрытьРасшифровкуВладения(Акционер, ОбъектВладения)
	
	Если НЕ ЗначениеЗаполнено(Акционер) ИЛИ НЕ ЗначениеЗаполнено(ОбъектВладения) Тогда
		Возврат;
	КонецЕсли;
	
	Отбор          = Новый Структура("Акционер, ОбъектВладения", Акционер, ОбъектВладения);
	СтрокиВладения = ДолиВладения.НайтиСтроки(Отбор);
	Для каждого СтрокаВладения Из СтрокиВладения Цикл
		ПоказатьРасшифровкуРасчета(СтрокаВладения);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьОтображениеРазделов()
	
	Элементы.ГруппаНастройкиИОтборы.Видимость = НЕ СкрытьНастройки;
	Элементы.ГрафическаяСхема.Видимость       = НЕ СкрытьГрафическуюСхему;
	Элементы.ДолиВладения.Видимость           = ОтображатьТаблицуЗначений;
	
	Элементы.ФормаКомандаДополнительныеНастройки.Пометка = ДополнительныеНастройки;
	Элементы.ПорогТочности.Видимость                     = ДополнительныеНастройки И НЕ СкрытьНастройки;
	Элементы.ПолнаяЭффективнаяДоля.Видимость             = ДополнительныеНастройки И НЕ СкрытьНастройки;
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьОтборСписком(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура;
	Если Элемент = Элементы.ОбъектИнвестирования Тогда
		ПараметрыФормы.Вставить("Заголовок", НСтр("ru='Объекты инвестирования'"));
		ПараметрыФормы.Вставить("ЗначенияОтбора", Отчет.ОбъектИнвестирования);
		ПараметрыФормы.Вставить("ТипОтбора",
			Новый ОписаниеТипов("СправочникСсылка.Организации, СправочникСсылка.ФизическиеЛица"));
	ИначеЕсли Элемент = Элементы.Акционер Тогда
		ПараметрыФормы.Вставить("Заголовок", НСтр("ru='Акционеры'"));
		ПараметрыФормы.Вставить("ЗначенияОтбора", Отчет.Акционер);
		ПараметрыФормы.Вставить("ТипОтбора",
			Новый ОписаниеТипов("СправочникСсылка.Контрагенты, СправочникСсылка.Организации, СправочникСсылка.ФизическиеЛица"));
	КонецЕсли;
	
	ОткрытьФорму("Отчет.бит_СтруктураВладения.Форма.НастройкаОтбораСписком", ПараметрыФормы, Элемент,
						УникальныйИдентификатор,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаПодсказкиОбъектаИнвестирования()
	
	Элементы.ОбъектИнвестирования.ПодсказкаВвода = ?(ЗначениеЗаполнено(Отчет.ОбъектИнвестирования), "",
													НСтр("ru='все объекты'"));
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаПодсказкиАкционера()
	
	Элементы.Акционер.ПодсказкаВвода = ?(ЗначениеЗаполнено(Отчет.Акционер), "",
													НСтр("ru='все акционеры'"));
	
КонецПроцедуры

#КонецОбласти
